# Direction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..Direction Property
FabricArea Class See Also
---
The Major Direction of the Fabric Area.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ Direction { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Direction As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Direction {
	XYZ^ get ();
}
```

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace